flow_past_heated_square_2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (2 0 0)
    (5 0 0)
    (0 1 0)
    (1 1 0)
    (2 1 0)
    (5 1 0)
    (0 2 0)
    (1 2 0)
    (2 2 0)
    (5 2 0)
    (0 3 0)
    (1 3 0)
    (2 3 0)
    (5 3 0)
    (0 0 0.1)
    (1 0 0.1)
    (2 0 0.1)
    (5 0 0.1)
    (0 1 0.1)
    (1 1 0.1)
    (2 1 0.1)
    (5 1 0.1)
    (0 2 0.1)
    (1 2 0.1)
    (2 2 0.1)
    (5 2 0.1)
    (0 3 0.1)
    (1 3 0.1)
    (2 3 0.1)
    (5 3 0.1)
);

blocks
(
    hex (0 1 5 4 16 17 21 20) (10 10 1) simpleGrading (1 1 1)
    hex (1 2 6 5 17 18 22 21) (10 10 1) simpleGrading (1 1 1)
    hex (2 3 7 6 18 19 23 22) (30 10 1) simpleGrading (1 1 1)
    hex (4 5 9 8 20 21 25 24) (10 10 1) simpleGrading (1 1 1)
    hex (6 7 11 10 22 23 27 26) (30 10 1) simpleGrading (1 1 1)
    hex (8 9 13 12 24 25 29 28) (10 10 1) simpleGrading (1 1 1)
    hex (9 10 14 13 25 26 30 29) (10 10 1) simpleGrading (1 1 1)
    hex (10 11 15 14 26 27 31 30) (30 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 16 20 4)
            (4 20 24 8)
            (8 24 28 12)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (7 23 19 3)
            (11 27 23 7)
            (15 31 27 11)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 17 16)
            (1 2 18 17)
            (2 3 19 18)
            (12 13 29 28)
            (13 14 30 29)
            (14 15 31 30)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (5 9 25 21)
            (5 6 22 21)
            (10 26 22 6)
            (9 10 26 25)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
